
      ******************************************************************
      * LIVE BANK - COPYBOOK FOR DEPOSIT ACCOUNT RECORD
      ******************************************************************
       01 DEPOSIT-ACCOUNT-RECORD.
          05 DA-ACCOUNT-NUMBER    PIC 9(12).
          05 DA-CUSTOMER-ID       PIC 9(10).
          05 DA-ACCOUNT-TYPE      PIC X(04).
          05 DA-CURRENT-BALANCE   PIC S9(13)V99 COMP-3.
          05 DA-OPEN-DATE         PIC X(10).
